{
  "home": "Startseite",
  "resume": "Lebenslauf",
  "career_path": "Karriereweg",
  "projects": "Projekte",
  "blog": "Blog",
  "github": "Github",
  "linkedin": "LinkedIn",
  "contact-info": "Av. Alcoy 45, 5o, 03009, Alicante, Spanien",
  "proffesional_role": "Berufsrolle",
  "proffesional_summary": "Ein hart arbeitender, kreativer und geselliger IT-Manager mit jahrelanger Erfahrung in der Leitung von Technologieprojekten, der Bereitstellung von Dienstleistungen höchster Qualität und der Pflege von Beziehungen zu Stakeholdern und Kunden.",
  "work_experience": "Berufserfahrung",
  "work_experience_1_title": "SERVICE IT MANAGER",
  "work_experience_1_subtitle": "Better Consultants S.L. | Remote | Februar 2024 - Jetzt",
  "work_experience_1_detail": "Überwachung der Ausrichtung der IT-Servicebereitstellung an den Zielen, Optimierung der Ressourcenzuweisung. Leitung von Prozessen für Incident-, Problem- und Änderungsmanagement. Sicherstellung der Einhaltung von Vorschriften und effektive Kommunikation mit Stakeholdern.",
  "work_experience_1_feature_1": "Kommunikation zwischen Kunde und Anbieter",
  "work_experience_1_feature_2": "Teammanagement und Entwicklungsüberwachung",
  "work_experience_1_feature_3": "Qualitätssicherung",
  "work_experience_1_feature_4": "Projektmanagement",
  "work_experience_2_title": "DRUPAL WEBENTWICKLER",
  "work_experience_2_subtitle": "Coosto Spain S.L. | Alicante | Juli 2020 - Januar 2024",
  "work_experience_2_detail": "Eigenständige Leitung der dynamischen Entwicklung der Hauptwebsite des Unternehmens. Migrationen durchgeführt, Module entwickelt, Updates erleichtert und die Entwicklung neuer Komponenten vorangetrieben.",
  "work_experience_2_feature_1": "Technischer Support für die Inhaltserstellung",
  "work_experience_2_feature_2": "Entwicklung neuer Funktionen",
  "work_experience_2_feature_3": "Verwaltung von Google Analytics und Google Tag Manager",
  "work_experience_2_feature_4": "SEO-Verbesserungen",
  "work_experience_3_title": "FORSCHUNGSASSISTENT",
  "work_experience_3_subtitle": "Universität von Jaén | Jaén | September 2018 - Dezember 2018",
  "work_experience_3_detail": "Forschungsassistent in einem Entwicklerteam der Informatikabteilung, Bereich der Verarbeitung natürlicher Sprache. Projekt: Darstellung von Hass in der natürlichen Sprache in sozialen Netzwerken.",
  "work_experience_3_feature_1": "Webentwicklung",
  "work_experience_3_feature_2": "Stimmungsanalyse",
  "work_experience_3_feature_3": "Verarbeitung natürlicher Sprache",
  "work_experience_3_feature_4": "Integration von Deep-Learning-Neuronalen Netzwerken basierend auf Wörterbüchern",
  "education": "Ausbildung",
  "education_1_strong": "Abschluss in Informatik mit einem Auslandsjahr an der Umeå Universität, Schweden",
  "education_2_strong": "Master in Webanwendungsentwicklung",
  "education_1": "| Universität von Jaén, Jaén | 2014 / 2019",
  "education_2": "| Offene Universität von Katalonien, Fernstudium | 2019 / 2020",
  "volunteering": "Ehrenamt",
  "volunteering_title": "Erasmus Student Network (ESN)| September 2019 - Juni 2021 ",
  "volunteering_subtitle": "Website-Inhaltsadministrator - Drupal 7",
  "volunteering_content": "Stellvertretender Vorsitzender des Ausschusses (ITcom) für die Entwicklung einer neuen Vorlage für die Organisation auf europäischer Ebene, Satellite 5 (Theme) - Drupal 9",
  "skills": "Fähigkeiten",
  "skills_technical": "Technische Fähigkeiten",
  "skills_technical_1": "Drupal (8-10) - Fortgeschritten",
  "skills_technical_2": "HTML/CSS/JavaScript - Fortgeschritten",
  "skills_technical_3": "Vue/Svelte/TypeScript - Mittelstufe",
  "skills_technical_4": "PHP/Python - Mittelstufe",
  "skills_technical_5": "Java/Go - Anfänger",
  "skills_proffessional": "Berufliche Fähigkeiten",
  "skills_proffessional_1": "Scrum- und Kanban-Format",
  "skills_proffessional_2": "Codequalität",
  "skills_proffessional_3": "Teammanagement",
  "skills_proffessional_4": "Qualität der Kundenbeziehung",
  "languages": "Sprachen",
  "languages_1": "Spanisch - Muttersprache",
  "languages_2": "Englisch - Fließend",
  "languages_3": "Deutsch - Grundkenntnisse",
  "print_resume": "Lebenslauf als PDF drucken",
  "blog_1_title": "Mein erstes Projekt mit Svelte: Lernen, effiziente Websites zu erstellen",
  "blog_1_summary": "Svelte für mein erstes Projekt zu erforschen, markiert den Beginn einer Reise in eine Technologie, die für den Aufbau hoch effizienter Websites entwickelt wurde. Mein Ziel ist es, durch Praxis zu lernen – ein Projekt von Grund auf zu erstellen, um die einzigartigen Funktionen von Svelte zu verstehen, wie seine Leichtigkeit, Reaktivität und Geschwindigkeit.",
  "blog_1_detail": "Als ich zum ersten Mal von Svelte hörte, war ich fasziniert von seinem Versprechen der Einfachheit und Effizienz bei der Erstellung von Webanwendungen. Im Gegensatz zu herkömmlichen Frameworks, die eine Laufzeitebene hinzufügen, kompiliert Svelte Komponenten während der Buildzeit in hoch optimierten JavaScript, was schnellere Ladezeiten und minimalen Ressourcenverbrauch garantiert.\nMein Ziel für dieses Projekt ist es, nicht nur eine Website zu erstellen, sondern mich in das Svelte-Ökosystem zu vertiefen. Ich plane, dessen reaktive Zustandsverwaltung, komponentenbasierte Architektur und das Fehlen eines virtuellen DOM zu erkunden. Indem ich tief in diese Technologie eintauche, möchte ich lernen, wie man moderne, leistungsstarke Web-Erlebnisse gestaltet.\nDie Reise wird beinhalten, ein Projektkonzept zu entwickeln – vielleicht ein persönliches Portfolio oder eine kleine E-Commerce-Plattform. Ich werde mit dem Verständnis der Grundlagen von Svelte beginnen: ein Projekt einrichten, meine ersten Komponenten schreiben und Zustände reaktiv verwalten. Von dort aus werde ich fortgeschrittene Konzepte wie serverseitiges Rendering (SSR) und die Integration externer APIs erkunden.\nDurch diesen praktischen Lernprozess hoffe ich, nicht nur in Svelte kompetent zu werden, sondern auch Best Practices für den Aufbau schneller, leichter und benutzerfreundlicher Websites zu übernehmen. Dieses Projekt ist mein Sprungbrett, um eines der spannendsten Webentwicklungstools zu meistern.\nErwartete wichtige Erkenntnisse:\nBeherrschen der Svelte-Komponentenstruktur und Reaktivität.\nLernen, die Website-Performance durch effizientes Design zu optimieren.\nVerstehen der leistungsstarken Tools von SvelteKit für Routing, SSR und Bereitstellung.\nBleiben Sie auf dem Laufenden über diese Reise, da ich Lektionen, Herausforderungen und Endergebnisse teilen werde.",
  "blog_published": "Veröffentlicht am ",
  "blog_not_found": "Blogbeitrag nicht gefunden.",
  "blog_back": "Zurück zum Blog",
  "read_more": "Weiterlesen",
  "work_experience_title_1": "Service IT-Manager",
  "work_experience_content_1": "Verwaltung des täglichen Betriebs der IT-Service-Abteilung, Sicherstellung eines reibungslosen Funktionierens von Systemen, Servern und Netzwerken. Verbesserung der Systemleistung und Reduzierung von Ausfallzeiten durch Implementierung effektiver IT-Support-Strategien. Eingesetzte Sprachen und Technologien: Vue, Directus, Java für SAP, Gitlab, Jira und Confluence. Microsoft Teams zur Kommunikation.",
  "work_experience_title_2": "Drupal-Webentwickler",
  "work_experience_content_2": "Entwicklung und Pflege von Drupal-Websites mit benutzerdefinierten Themes und Modulen. Integration von Drittanbieter-Diensten und Sicherstellung benutzerfreundlicher, sicherer und geräteübergreifend reaktionsfähiger Websites. Eingesetzte Sprachen und Technologien: Drupal, Vue, NodeJS, Bitbucket, Jira und Custom Wiki. Zoom und Mattermost zur Kommunikation.",
  "work_experience_title_3": "Forschungsassistent",
  "work_experience_content_3": "Leitung von Forschungsinitiativen im Bereich der Webentwicklung und Informatik. Veröffentlichung von Forschungspapieren und Zusammenarbeit mit anderen Forschern und Entwicklern, um Innovationen in der Branche voranzutreiben. Eingesetzte Sprachen und Technologien: Flask, Django, PHP und Redmine. E-Mail und tägliche Meetings zur Kommunikation.",
  "education_title_1": "Abschluss in Informatik",
  "education_content_1": "Abschluss in Informatik mit Fokus auf Softwareentwicklung, Computernetzwerke und IT-Sicherheit. Dies umfasste praktische Projekte, theoretisches Wissen und Zusammenarbeit mit Kollegen und Dozenten.",
  "education_title_2": "Master in Webanwendungsentwicklung",
  "education_content_2": "Vertiefung in moderne Webtechnologien, Benutzererfahrung (UX) und Datenintegration. Die Studienarbeit umfasste die Entwicklung von Webanwendungen, die sicher, skalierbar und leicht zu warten sind.",
  "volunteering_title_1": "Website-Inhaltsadministrator",
  "volunteering_content_1": "Verwaltung der Inhalte für die Website einer gemeinnützigen Organisation, Sicherstellung aktueller und zielgerichteter Inhalte. Optimierung der Inhalte für SEO und Steigerung des Benutzerengagements durch visuelle und textuelle Verbesserungen.",
  "volunteering_title_2": "Stellvertretender Vorsitzender des Ausschusses (ITcom)",
  "volunteering_content_2": "Als stellvertretender Vorsitzender des ITcom-Ausschusses Organisation von Technologieveranstaltungen, Mentoring von Mitgliedern und Zusammenarbeit mit Branchenexperten. Unterstützung der strategischen Ausrichtung des Ausschusses zur Förderung von Innovation und beruflicher Entwicklung innerhalb der ESN-Organisation.",
  "techskills_title_1": "Drupal (8-10) - Fortgeschritten",
  "techskills_content_1": "Erfahren im Aufbau und der Wartung dynamischer Websites mit Drupal. Kompetent in der Entwicklung benutzerdefinierter Module, Theme-Anpassungen und der Integration von Drittanbieter-Diensten. Berufserfahrung: 4 Jahre + 2 Jahre als Drupal-Systemadministrator.",
  "techskills_title_2": "HTML/CSS/JavaScript - Fortgeschritten",
  "techskills_content_2": "Fundierte Kenntnisse in HTML5, CSS3 und JavaScript. Expertise in der Erstellung reaktionsfähiger Layouts, CSS-Animationen und interaktiver Benutzeroberflächen mit JavaScript. 7 Jahre Erfahrung, davon 5 Jahre professionell.",
  "techskills_title_3": "Vue/Svelte/TypeScript - Mittelstufe",
  "techskills_content_3": "Mittlerer Erfahrungsstand mit Vue.js, Svelte und TypeScript für den Aufbau von Webanwendungen. Vertraut mit Zustandsverwaltung und komponentenbasierter Entwicklung. 2 Jahre Berufserfahrung und ein weiteres Jahr Studienerfahrung mit Angular.",
  "techskills_title_4": "PHP/Python - Mittelstufe",
  "techskills_content_4": "Mittlere Erfahrung in PHP und Python für Backend-Entwicklung. Erfahrung mit Frameworks wie Laravel für PHP und Flask für Python sowie der Integration von Datenbanken und APIs. 4 Jahre Berufserfahrung mit PHP + 3 Jahre Erfahrung mit Python, die sowohl Studien- als auch Hobbyerfahrung umfassen.",
  "techskills_title_5": "Java/NodeJS/Go - Anfänger",
  "techskills_content_5": "Anfängerkenntnisse in Java, NodeJS und Go. Vertraut mit der Entwicklung grundlegender Anwendungen, der Nutzung von Bibliotheken und dem Verständnis grundlegender Programmierkonzepte. 1 Jahr Hobbyerfahrung mit Java und Go.",
  "personalskills_title_1": "Scrum- und Kanban-Format",
  "personalskills_content_1": "Erfahren in agilen Entwicklungsmethoden, insbesondere Scrum und Kanban. Kompetent im Management von Sprints, der Sicherstellung effizienter Arbeitsabläufe und der pünktlichen Lieferung qualitativ hochwertiger Projekte.",
  "personalskills_title_2": "Codequalität",
  "personalskills_content_2": "Starker Fokus auf Codequalität, einschließlich Schreiben von sauberem, effizientem und wartbarem Code. Vertraut mit Code-Review-Prozessen, Unit-Tests und Debugging-Techniken.",
  "personalskills_title_3": "Teammanagement",
  "personalskills_content_3": "Erfahren im Management und in der Mitarbeit in funktionsübergreifenden Teams. Kompetent in der Förderung von Zusammenarbeit, der Lösung von Konflikten und der Sicherstellung, dass Teammitglieder effektiv zusammenarbeiten.",
  "personalskills_title_4": "Qualität der Kundenbeziehung",
  "personalskills_content_4": "Erfahren im Management von Kundenbeziehungen und der Sicherstellung von Zufriedenheit durch klare Kommunikation, das Verständnis ihrer Bedürfnisse und die Bereitstellung qualitativ hochwertiger Lösungen.",
  "language_title_1": "Spanisch - Muttersprache",
  "language_content_1": "Muttersprache Spanisch.",
  "language_title_2": "Englisch - Fließend",
  "language_content_2": "Englischsprecher seit der Grundschule. Aktuelles Niveau C1.",
  "language_title_3": "Deutsch - Grundkenntnisse",
  "language_content_3": "Deutschsprecher seit 2021. Aktuelles Niveau A2.",
  "tech_skills": "Technische Fähigkeiten",
  "personal_skills": "Persönliche Fähigkeiten"
}