{
  "home": "Home",
  "resume": "Resume",
  "career_path": "Career Path",
  "projects": "Projects",
  "blog": "Blog",
  "github": "Github",
  "linkedin": "LinkedIn",
  "contact-info": "Av. Alcoy 45, 5o, 03009, Alicante, Spain",
  "proffesional_role":"Proffesional role",
  "proffesional_summary":"A hard-working, creative, and sociable IT manager with years of experience leading tech projects, delivering the highest quality of services, and maintaining relationships with stakeholders and clients.",
  "work_experience":"Work experience",
  "work_experience_1_title":"SERVICE IT MANAGER",
  "work_experience_1_subtitle":"Better Consultants S.L. | Remote | February 2024 - Now",
  "work_experience_1_detail":"Oversaw IT service delivery alignment with goals, optimized resource allocation. Led incident, problem, and change management processes. Ensured compliance and communicated effectively with stakeholders.",
  "work_experience_1_feature_1":"Client - Provider communication",
  "work_experience_1_feature_2":"Team management and developments supervisor",
  "work_experience_1_feature_3":"Quality assurance",
  "work_experience_1_feature_4":"Project management",
  "work_experience_2_title":"DRUPAL WEB DEVELOPER",
  "work_experience_2_subtitle":"Coosto Spain S.L. | Alicante | July 2020 - January 2024",
  "work_experience_2_detail":"Single-handedly spearheaded the dynamic development of the company's primary website. Directed migrations, crafted modules, facilitated updates, and pioneered the development of novel components.",
  "work_experience_2_feature_1":"Technical support for content creation",
  "work_experience_2_feature_2":"New feature developments",
  "work_experience_2_feature_3":"Google analytics and Google Tag Manager management",
  "work_experience_2_feature_4":"SEO enhancements",
  "work_experience_3_title":"RESEARCH FELLOW",
  "work_experience_3_subtitle":"University of Jaén | Jaén | September 2018 - December 2018",
  "work_experience_3_detail":"Research fellow in a team of developers in the Department of Computer Science, Natural Language Processing area.Project: Representation of hate within natural language in social networks.",
  "work_experience_3_feature_1":"Web development",
  "work_experience_3_feature_2":"Sentiment analysis",
  "work_experience_3_feature_3":"Natural language processing",
  "work_experience_3_feature_4":"Integrations of deep learning neural networks based on word dictionaries",
  "education":"Education",
  "education_1_strong":"Degree in Computer Engineering with a year abroad at Umeå Universitet, Sweden",
  "education_2_strong":"Master's Degree in Web Application Development",
  "education_1":"| University of Jaén, Jaén | 2014 / 2019",
  "education_2":"| Open university of Catalunya, Remote | 2019 / 2020",
  "volunteering":"Volunteering",
  "volunteering_title":"Erasmus Student Network (ESN)| September 2019 - June 2021 ",
  "volunteering_subtitle":"Website content administrator - Drupal 7",
  "volunteering_content":"Vice-chair of the committee (ITcom) for the development of a new template for the association at European level, Satellite 5 (theme) - Drupal 9",
  "skills":"Skills",
  "skills_technical":"Technical",
  "skills_technical_1":"Drupal (8-10) - Advanced",
  "skills_technical_2":"HTML/CSS/JavaScript - Advanced",
  "skills_technical_3":"Vue/Svelte/TypeScript - Intermediate",
  "skills_technical_4":"PHP/Python - Intermediate",
  "skills_technical_5":"Java/Go - Beginner",
  "skills_proffessional":"Proffessional",
  "skills_proffessional_1":"Scrum format and Kanban",
  "skills_proffessional_2":"Code quality",
  "skills_proffessional_3":"Teamwork management",
  "skills_proffessional_4":"Client relationship quality",
  "languages":"Languages",
  "languages_1":"Spanish - Native speaker",
  "languages_2":"English - Fluent",
  "languages_3":"German - Basic",
  "print_resume":"Print Resume as PDF",
  "blog_1_title": "My First Project with Svelte: Learning to Build Efficient Websites",
  "blog_1_summary": "Exploring Svelte for my first project marks the beginning of a journey into a technology designed for building highly efficient websites. My goal is to learn by doing—creating a project from scratch to understand Svelte's unique features, such as its lightweight nature, reactivity, and speed.",
  "blog_1_detail": "When I first heard about Svelte, I was intrigued by its promise of simplicity and efficiency in building web applications. Unlike traditional frameworks that add a runtime layer, Svelte compiles components into highly optimized JavaScript during build time, ensuring faster load times and minimal resource usage.\nMy goal for this project is not just to create a website but to immerse myself in Svelte’s ecosystem. I plan to explore its reactive state management, component-based architecture, and the absence of a virtual DOM. By diving deep into this technology, I aim to understand how to craft modern, high-performance web experiences.\nThe journey will involve brainstorming a project idea—perhaps a personal portfolio or a small e-commerce platform. I will start with understanding the fundamentals of Svelte: setting up a project, writing my first components, and managing state reactively. From there, I’ll explore advanced concepts like server-side rendering (SSR) and integrating external APIs.\nThrough this hands-on learning process, I hope to not only become proficient in Svelte but also adopt best practices for building websites that are fast, lightweight, and user-friendly. This project is my stepping stone into mastering one of the most exciting web development tools available today.\nKey Learnings I Anticipate:\nMastering Svelte's component structure and reactivity.\nLearning to optimize website performance through efficient design.\nUnderstanding SvelteKit’s powerful tools for routing, SSR, and deployment.\nStay tuned for updates on this journey, as I’ll be sharing lessons learned, challenges faced, and the final results.",
  "blog_published": "Published on ",
  "blog_not_found": "Blog post not found.",
  "blog_back": "Back to Blog",
  "read_more": "Read more",
  "work_experience_title_1": "Service IT Manager",
  "work_experience_content_1": "Managed the day-to-day operations of the IT service department, ensuring systems, servers, and networks functioned smoothly. Improved system performance and reduced downtime by implementing effective IT support strategies. Languages and technologies involved: Vue, Directus, Java for SAP, Gitlab, Jira and Confluence. Microsoft Teams for communication.",
  "work_experience_title_2": "Drupal Web Developer",
  "work_experience_content_2": "Developed and maintained Drupal websites with custom themes and modules. Integrated third-party services and ensured websites were user-friendly, secure, and responsive across devices. Languages and technologies involved: Drupal, Vue, NodeJS, Bitbucket, Jira and Custom Wiki. Zoom and Mattermost for communication.",
  "work_experience_title_3": "Research Fellow",
  "work_experience_content_3": "Led research initiatives in the field of web development and computer science. Published research papers and collaborated with other researchers and developers to drive innovations in the industry. Languages and technologies involved: Flask, Django, PHP and Redmine. Email and daily meetings for communication.",
  "education_title_1": "Computing Engineer Degree",
  "education_content_1": "Earned a Computing Engineer Degree, focusing on software development, computer networks and database management. Developed a strong foundation in programming languages and general algorithms.",
  "education_title_2": "Master's Degree in Web Application Development",
  "education_content_2": "Completed a Master's Degree in Web Application Development. Specialized in front-end and back-end technologies, working with frameworks like Angular for development, Cypress for Testing and backend built in Python and PHP, with special focus on creating scalable, secure web applications.",
  "volunteering_title_1": "Website Content Administrator",
  "volunteering_content_1": "Managed the content for a non-profit organization's website, ensuring the content was up-to-date and aligned with the organization's goals. Optimized content for SEO and enhanced user engagement through visual and textual improvements.",
  "volunteering_title_2": "Vice-chair of the committee (ITcom)",
  "volunteering_content_2": "Served as Vice-chair of the ITcom committee, organizing tech events, mentoring members, and collaborating with industry professionals. Helped guide the committee’s strategy to support innovation and professional development in the tech community inside ESN organization.",
  "techskills_title_1": "Drupal (8-10) - Advanced",
  "techskills_content_1": "Proficient in building and maintaining dynamic websites using Drupal. Experience with custom module development, theme customization, and integrating third-party services. Proffessional work experience: 4 years + 2 years as drupal system administrator.",
  "techskills_title_2": "HTML/CSS/JavaScript - Advanced",
  "techskills_content_2": "Strong command over HTML5, CSS3, and JavaScript. Expertise in creating responsive layouts, CSS animations, and interactive user interfaces with JavaScript. 7 years of experience, 5 of them being proffessional.",
  "techskills_title_3": "Vue/Svelte/TypeScript - Intermediate",
  "techskills_content_3": "Intermediate experience with Vue.js, Svelte, and TypeScript for building web applications. Comfortable with state management and component-driven development. 2 years of proffessional experience and an extra year with studying experience in Angular.",
  "techskills_title_4": "PHP/Python - Intermediate",
  "techskills_content_4": "Mid-level experience in PHP and Python for back-end development. Experience with frameworks like Laravel for PHP and Flask for Python, as well as integrating databases and APIs. 4 years of proffesional experience with PHP + 3 years of Python experience that gathers both studying and hobby experience.",
  "techskills_title_5": "Java/NodeJS/Go - Beginner",
  "techskills_content_5": "Beginner-level knowledge of Java, NodeJS and Go. Familiar with building basic applications, using libraries, and understanding core programming concepts. 1 year of hobby experience with both Java and Go.",
  "personalskills_title_1": "Scrum format and Kanban",
  "personalskills_content_1": "Experienced in Agile development practices, particularly Scrum and Kanban. Skilled at managing sprints, ensuring efficient workflows, and delivering high-quality projects on time.",
  "personalskills_title_2": "Code quality",
  "personalskills_content_2": "Strong focus on code quality, including writing clean, efficient, and maintainable code. Familiar with code review processes, unit testing, and debugging techniques.",
  "personalskills_title_3": "Teamwork management",
  "personalskills_content_3": "Proficient in managing and participating in cross-functional teams. Skilled at fostering collaboration, resolving conflicts, and ensuring that team members work effectively together.",
  "personalskills_title_4": "Client relationship quality",
  "personalskills_content_4": "Experienced in managing client relationships and ensuring satisfaction through clear communication, understanding their needs, and delivering high-quality solutions.",
  "language_title_1": "Spanish - Native",
  "language_content_1": "Native Spanish speaker.",
  "language_title_2": "English - Fluent",
  "language_content_2": "English speaker since primary school. Current level C1.",
  "language_title_3": "German - Basic",
  "language_content_3": "German speaker since 2021. Current level A2.",
  "tech_skills": "Technical skills",
  "personal_skills": "Personal skills",
  "about_me": "About me",
  "about_passion": "Passionate and detail-oriented Full-Stack Developer with expertise in front-end and back-end technologies, including JavaScript, Vue3, Python, Node.js, and databases like MongoDB and PostgreSQL. Adept at designing scalable web applications, optimizing user experience, and implementing efficient backend solutions.",
  "about_experience": "Proven ability to develop and maintain high-quality applications, collaborating with cross-functional teams to deliver seamless digital experiences.",
  "about_goals": "Looking to leverage my technical skills and problem-solving abilities to contribute to innovative projects, while continuously learning and evolving within the tech industry. My long-term goal is to lead a development team in creating impactful software solutions.",
  "redirection_error": "You have been redirected because the previous URL did not exist.",
  "on_going": "On going",
  "on_hold": "On hold",
  "in_development": "In development",
  "finished": "Finished",
  "tech_infographies": "Technologies Infographics",
  "tech_infographies_why": "Project goals: ",
  "tech_infographies_main": "Main tasks:",
  "tech_infographies_status": "Status",
  "tech_infographies_start": "Start date: ",
  "tech_infographies_end": "End date: ",
  "tech_infographies_repo": "View Repository",
  "tech_infographies_live": "View Live",
  "tech_infographies_docs": "Project Documentation",
  "tech_infographies_protected_data": "Protected repository",
  "hema_reason": "Creation and maintenance of an efficient and fast fashion atelier e-commerce portal.",
  "catalog": "Catalog renderization",
  "product": "Product selection",
  "cart": "Cart management",
  "checkout": "Fast checkout",
  "whoami_reason": "Personal portfolio website.",
  "resume_visual": "Resume visualization",
  "project_exh": "Project exhibition",
  "professional_development": "Professional development and contact.",
  "financapp_reason_fe": "Personal finances application. Salary and mortgage calculator. Stock market investments tracking.",
  "data": "Data visualization",
  "user_auth": "User authentication",
  "API": "API integrations",
  "economic_calc": "Different economic calculations",
  "exodus_reason_fe": "Frontend data visualization for user living standards studies and migration puposes.",
  "living_metrics": "Living metrics calculation",
  "coosto_reason": "Company's public website used for marketing and sales purposes.",
  "user_data": "User data tracking",
  "user_management": "User management",
  "market_campaigns": "Marketing campaigns",
  "financapp_reason_be": "Backend data calculations and API management from Real time data sources and historical sources (Finhub and Yahoo finance).",
  "live_not": "Live notifications",
  "API_end": "RESTful API endpoints",
  "exodus_reason_be": "Backend data calculations for user living standards studies and migration puposes.",
  "data_collection": "Data collection",
  "currency": "Currency change",
  "tech_infographies_github": "Visit my GitHub",
  "tech_infographies_projects": "Take a look to my projects",
  "poetry_ai_gen_reason": "Poetry AI generator based on neural networks",
  "data_gen": "Data generation",
  "mach_learn": "Machine learning",
  "neural_net": "Neural networks"
}
