{
  "home": "Home",
  "resume": "Resume",
  "career_path": "Career Path",
  "projects": "Projects",
  "blog": "Blog",
  "github": "Github",
  "linkedin": "LinkedIn",
  "contact-info": "Av. Alcoy 45, 5o, 03009, Alicante, Spain",
  "proffesional_role":"Proffesional role",
  "proffesional_summary":"A hard-working, creative, and sociable IT manager with years of experience leading tech projects, delivering the highest quality of services, and maintaining relationships with stakeholders and clients.",
  "work_experience":"Work experience",
  "work_experience_1_title":"SERVICE IT MANAGER",
  "work_experience_1_subtitle":"Better Consultants S.L. | Remote | February 2024 - Now",
  "work_experience_1_detail":"Oversaw IT service delivery alignment with goals, optimized resource allocation. Led incident, problem, and change management processes. Ensured compliance and communicated effectively with stakeholders.",
  "work_experience_1_feature_1":"Client - Provider communication",
  "work_experience_1_feature_2":"Team management and developments supervisor",
  "work_experience_1_feature_3":"Quality assurance",
  "work_experience_1_feature_4":"Project management",
  "work_experience_2_title":"DRUPAL WEB DEVELOPER",
  "work_experience_2_subtitle":"Coosto Spain S.L. | Alicante | July 2020 - January 2024",
  "work_experience_2_detail":"Single-handedly spearheaded the dynamic development of the company's primary website. Directed migrations, crafted modules, facilitated updates, and pioneered the development of novel components.",
  "work_experience_2_feature_1":"Technical support for content creation",
  "work_experience_2_feature_2":"New feature developments",
  "work_experience_2_feature_3":"Google analytics and Google Tag Manager management",
  "work_experience_2_feature_4":"SEO enhancements",
  "work_experience_3_title":"RESEARCH FELLOW",
  "work_experience_3_subtitle":"University of Jaén | Jaén | September 2018 - December 2018",
  "work_experience_3_detail":"Research fellow in a team of developers in the Department of Computer Science, Natural Language Processing area.Project: Representation of hate within natural language in social networks.",
  "work_experience_3_feature_1":"Web development",
  "work_experience_3_feature_2":"Sentiment analysis",
  "work_experience_3_feature_3":"Natural language processing",
  "work_experience_3_feature_4":"Integrations of deep learning neural networks based on word dictionaries",
  "education":"Education",
  "education_1_strong":"Degree in Computer Engineering with a year abroad at Umeå Universitet, Sweden",
  "education_2_strong":"Master's Degree in Web Application Development",
  "education_1":"| University of Jaén, Jaén | 2014 / 2019",
  "education_2":"| Open university of Catalunya, Remote | 2019 / 2020",
  "volunteering":"Volunteering",
  "volunteering_title":"Erasmus Student Network (ESN)| September 2019 - June 2021 ",
  "volunteering_subtitle":"Website content administrator - Drupal 7",
  "volunteering_content":"Vice-chair of the committee (ITcom) for the development of a new template for the association at European level, Satellite 5 (theme) - Drupal 9",
  "skills":"Skills",
  "skills_technical":"Technical",
  "skills_technical_1":"Drupal (8-10) - Advanced",
  "skills_technical_2":"HTML/CSS/JavaScript - Advanced",
  "skills_technical_3":"Vue/Svelte/TypeScript - Intermediate",
  "skills_technical_4":"PHP/Python - Intermediate",
  "skills_technical_5":"Java/Go - Beginner",
  "skills_proffessional":"Proffessional",
  "skills_proffessional_1":"Scrum format and Kanban",
  "skills_proffessional_2":"Code quality",
  "skills_proffessional_3":"Teamwork management",
  "skills_proffessional_4":"Client relationship quality",
  "languages":"Languages",
  "languages_1":"Spanish - Native speaker",
  "languages_2":"English - Fluent",
  "languages_3":"German - Basic",
  "print_resume":"Print Resume as PDF",
  "blog_1_title": "My First Project with Svelte: Learning to Build Efficient Websites",
  "blog_1_summary": "Exploring Svelte for my first project marks the beginning of a journey into a technology designed for building highly efficient websites. My goal is to learn by doing—creating a project from scratch to understand Svelte's unique features, such as its lightweight nature, reactivity, and speed.",
  "blog_1_detail": "When I first heard about Svelte, I was intrigued by its promise of simplicity and efficiency in building web applications. Unlike traditional frameworks that add a runtime layer, Svelte compiles components into highly optimized JavaScript during build time, ensuring faster load times and minimal resource usage.\nMy goal for this project is not just to create a website but to immerse myself in Svelte’s ecosystem. I plan to explore its reactive state management, component-based architecture, and the absence of a virtual DOM. By diving deep into this technology, I aim to understand how to craft modern, high-performance web experiences.\nThe journey will involve brainstorming a project idea—perhaps a personal portfolio or a small e-commerce platform. I will start with understanding the fundamentals of Svelte: setting up a project, writing my first components, and managing state reactively. From there, I’ll explore advanced concepts like server-side rendering (SSR) and integrating external APIs.\nThrough this hands-on learning process, I hope to not only become proficient in Svelte but also adopt best practices for building websites that are fast, lightweight, and user-friendly. This project is my stepping stone into mastering one of the most exciting web development tools available today.\nKey Learnings I Anticipate:\nMastering Svelte's component structure and reactivity.\nLearning to optimize website performance through efficient design.\nUnderstanding SvelteKit’s powerful tools for routing, SSR, and deployment.\nStay tuned for updates on this journey, as I’ll be sharing lessons learned, challenges faced, and the final results.",
  "blog_published": "Published on ",
  "blog_not_found": "Blog post not found.",
  "blog_back": "Back to Blog",
  "read_more": "Read more"
}
