{
  "home": "Inicio",
  "resume": "Currículum",
  "career_path": "Carrera",
  "projects": "Proyectos",
  "blog": "Blog",
  "github": "Github",
  "linkedin": "LinkedIn",
  "contact-info": "Av. Alcoy 45, 5o, 03009, Alicante, España",
  "proffesional_role":"Rol profesional",
  "proffesional_summary": "Gerente de IT trabajador, creativo y sociable con años de experiencia liderando proyectos tecnológicos, ofreciendo la más alta calidad de servicios y manteniendo relaciones con las partes interesadas y clientes.",
  "work_experience": "Experiencia laboral",
  "work_experience_1_title": "GERENTE DE SERVICIO DE IT",
  "work_experience_1_subtitle": "Better Consultants S.L. | Remoto | Febrero 2024 - Actualidad",
  "work_experience_1_detail": "Supervisé la alineación de la entrega de servicios de IT con los objetivos, optimicé la asignación de recursos. Lideré los procesos de gestión de incidentes, problemas y cambios. Aseguré el cumplimiento y me comuniqué de manera efectiva con las partes interesadas.",
  "work_experience_1_feature_1": "Comunicación Cliente - Proveedor",
  "work_experience_1_feature_2": "Gestión de equipos y supervisión de desarrollos",
  "work_experience_1_feature_3": "Aseguramiento de la calidad",
  "work_experience_1_feature_4": "Gestión de proyectos",
  "work_experience_2_title": "DESARROLLADOR WEB DRUPAL",
  "work_experience_2_subtitle": "Coosto Spain S.L. | Alicante | Julio 2020 - Enero 2024",
  "work_experience_2_detail": "Lideré de forma independiente el desarrollo dinámico del sitio web principal de la empresa. Dirigí migraciones, creé módulos, facilité actualizaciones y fui pionero en el desarrollo de componentes novedosos.",
  "work_experience_2_feature_1": "Soporte técnico para la creación de contenido",
  "work_experience_2_feature_2": "Desarrollo de nuevas características",
  "work_experience_2_feature_3": "Gestión de Google Analytics y Google Tag Manager",
  "work_experience_2_feature_4": "Mejoras SEO",
  "work_experience_3_title": "INVESTIGADOR ASOCIADO",
  "work_experience_3_subtitle": "Universidad de Jaén | Jaén | Septiembre 2018 - Diciembre 2018",
  "work_experience_3_detail": "Investigador asociado en un equipo de desarrolladores en el Departamento de Informática, área de Procesamiento de Lenguaje Natural. Proyecto: Representación del odio dentro del lenguaje natural en redes sociales.",
  "work_experience_3_feature_1": "Desarrollo web",
  "work_experience_3_feature_2": "Análisis de sentimientos",
  "work_experience_3_feature_3": "Procesamiento de lenguaje natural",
  "work_experience_3_feature_4": "Integraciones de redes neuronales de aprendizaje profundo basadas en diccionarios de palabras",
  "education":"Educacion",
  "education_1_strong":"Grado en Ingeniería Informática con un año de experiencia internacional en la universidad de Umeå, Suecia",
  "education_2_strong":"Master en Desarrollo de aplicaciones web",
  "education_1":"| Universidad de Jaén, Jaén | 2014 / 2019",
  "education_2":"| Universidad abierta de Cataluña, Remoto | 2019 / 2020",
  "volunteering":"Voluntariado",
  "volunteering_title":"Erasmus Student Network (ESN)| Septiembre 2019 - Junio 2021 ",
  "volunteering_subtitle":"Administrador de contenido web - Drupal 7",
  "volunteering_content":"Vice-director del comite de IT (ITcom) para el desarrollo de una plantilla para la asociacion a nivel europeo llamada: Satellite 5 (theme) - Drupal 9",
  "skills":"Cononimientos",
  "skills_technical":"Tecnicos",
  "skills_technical_1":"Drupal (8-10) - Avanzado",
  "skills_technical_2":"HTML/CSS/JavaScript - Avanzado",
  "skills_technical_3":"Vue/Svelte/TypeScript - Intermedio",
  "skills_technical_4":"PHP/Python - Intermedio",
  "skills_technical_5":"Java/Go - Principiante",
  "skills_proffessional":"Profesionales",
  "skills_proffessional_1":"Metodologías ágiles como Scrum y Kanban",
  "skills_proffessional_2":"Código de calidad",
  "skills_proffessional_3":"Manejo del trabajo en equipo",
  "skills_proffessional_4":"Relacion de calidad con el cliente",
  "languages":"Idiomas hablados",
  "languages_1":"Español - Nativo",
  "languages_2":"Inglés - Fluido",
  "languages_3":"Alemán - Básico",
  "print_resume":"Imprimir CV en formato PDF",
  "blog_1_title": "Mi Primer Proyecto con Svelte: Aprendiendo a Crear Sitios Web Eficientes",
  "blog_1_summary": "Explorar Svelte en mi primer proyecto marca el inicio de un camino hacia una tecnología diseñada para construir sitios web altamente eficientes. Mi objetivo es aprender haciendo: crear un proyecto desde cero para entender las características únicas de Svelte, como su ligereza, reactividad y velocidad.",
  "blog_1_detail": "Cuando escuché por primera vez sobre Svelte, me intrigó su promesa de simplicidad y eficiencia en la construcción de aplicaciones web. A diferencia de los frameworks tradicionales que añaden una capa de ejecución, Svelte compila los componentes en JavaScript altamente optimizado durante la etapa de construcción, lo que garantiza tiempos de carga más rápidos y un uso mínimo de recursos.\nMi objetivo para este proyecto no es solo crear un sitio web, sino sumergirme completamente en el ecosistema de Svelte. Planeo explorar su gestión reactiva del estado, su arquitectura basada en componentes y la ausencia de un DOM virtual. Al profundizar en esta tecnología, busco aprender a diseñar experiencias web modernas y de alto rendimiento.\nEste camino implicará desarrollar una idea de proyecto, tal vez un portafolio personal o una pequeña plataforma de comercio electrónico. Comenzaré por comprender los fundamentos de Svelte: configurar un proyecto, escribir mis primeros componentes y gestionar el estado de forma reactiva. A partir de ahí, exploraré conceptos avanzados como la renderización en el servidor (SSR) e integración con APIs externas.\nA través de este proceso de aprendizaje práctico, espero no solo dominar Svelte, sino también adoptar las mejores prácticas para crear sitios web rápidos, ligeros y fáciles de usar. Este proyecto es mi primer paso para dominar una de las herramientas de desarrollo web más emocionantes disponibles hoy en día.\nAprendizajes Clave que Anticipo:\nDominar la estructura de componentes y reactividad de Svelte.\nAprender a optimizar el rendimiento del sitio web mediante un diseño eficiente.\nEntender las herramientas potentes de SvelteKit para enrutamiento, SSR y despliegue.\nMantente al tanto de las actualizaciones de este viaje, ya que compartiré las lecciones aprendidas, los desafíos enfrentados y el resultado final.",
  "blog_published": "Publicado en ",
  "blog_not_found": "Blog no encontrado",
  "blog_back": "Volver a Blog",
  "read_more": "Leer mas"
}
