{
  "home": "Inicio",
  "resume": "Currículum",
  "career_path": "Carrera",
  "projects": "Proyectos",
  "blog": "Blog",
  "github": "Github",
  "linkedin": "LinkedIn",
  "contact-info": "Av. Alcoy 45, 5o, 03009, Alicante, España",
  "proffesional_role":"Rol profesional",
  "proffesional_summary": "Gerente de IT trabajador, creativo y sociable con años de experiencia liderando proyectos tecnológicos, ofreciendo la más alta calidad de servicios y manteniendo relaciones con las partes interesadas y clientes.",
  "work_experience": "Experiencia laboral",
  "work_experience_1_title": "GERENTE DE SERVICIO DE IT",
  "work_experience_1_subtitle": "Better Consultants S.L. | Remoto | Febrero 2024 - Abril 2025",
  "work_experience_1_detail": "Supervisé la alineación de la entrega de servicios de IT con los objetivos, optimicé la asignación de recursos. Lideré los procesos de gestión de incidentes, problemas y cambios. Aseguré el cumplimiento y me comuniqué de manera efectiva con las partes interesadas.",
  "work_experience_1_feature_1": "Comunicación Cliente - Proveedor",
  "work_experience_1_feature_2": "Gestión de equipos y supervisión de desarrollos",
  "work_experience_1_feature_3": "Aseguramiento de la calidad",
  "work_experience_1_feature_4": "Gestión de proyectos",
  "work_experience_2_title": "DESARROLLADOR WEB DRUPAL",
  "work_experience_2_subtitle": "Coosto Spain S.L. | Alicante (Híbrido) | Julio 2020 - Enero 2024",
  "work_experience_2_detail": "Lideré de forma independiente el desarrollo dinámico del sitio web principal de la empresa. Dirigí migraciones, creé módulos, facilité actualizaciones y fui pionero en el desarrollo de componentes novedosos.",
  "work_experience_2_feature_1": "Soporte técnico para la creación de contenido",
  "work_experience_2_feature_2": "Desarrollo de nuevas características",
  "work_experience_2_feature_3": "Gestión de Google Analytics y Google Tag Manager",
  "work_experience_2_feature_4": "Mejoras SEO",
  "work_experience_3_title": "INVESTIGADOR ASOCIADO",
  "work_experience_3_subtitle": "Universidad de Jaén | Jaén | Septiembre 2018 - Diciembre 2018",
  "work_experience_3_detail": "Investigador asociado en un equipo de desarrolladores en el Departamento de Informática, área de Procesamiento de Lenguaje Natural. Proyecto: Representación del odio dentro del lenguaje natural en redes sociales.",
  "work_experience_3_feature_1": "Desarrollo web",
  "work_experience_3_feature_2": "Análisis de sentimientos",
  "work_experience_3_feature_3": "Procesamiento de lenguaje natural",
  "work_experience_3_feature_4": "Integraciones de redes neuronales de aprendizaje profundo basadas en diccionarios de palabras",
  "work_experience_4_title":"GESTOR DE DOMINIO",
  "work_experience_4_subtitle":"Banc Sabadell Digital | Alicante (Híbrido) | Abril 2025 - Actualidad",
  "work_experience_4_detail":"Gestor de dominio de la sección de pagos instantáneos. Bizum, transferencias instantáneas y reembolsos. Aseguramiento del cumplimiento de la normativa fintech y alineación con los objetivos de negocio para ofrecer servicios transaccionales rápidos, seguros y fiables.",
  "work_experience_4_feature_1":"Gestión de proyectos",
  "work_experience_4_feature_2":"Comunicación con stakeholders",
  "work_experience_4_feature_3":"Planificación de equipos internos y desarrollo organizado",
  "work_experience_4_feature_4":"Comunicación fluida con los proveedores externos involucrados",
  "education":"Educación",
  "education_1_strong":"Grado en Ingeniería Informática con un año de experiencia internacional en la universidad de Umeå, Suecia",
  "education_2_strong":"Master en Desarrollo de aplicaciones web",
  "education_1":"| Universidad de Jaén, Jaén | 2014 / 2019",
  "education_2":"| Universidad abierta de Cataluña, Remoto | 2019 / 2020",
  "volunteering":"Voluntariado",
  "volunteering_title":"Erasmus Student Network (ESN)| Septiembre 2019 - Junio 2021 ",
  "volunteering_subtitle":"Administrador de contenido web - Drupal 7",
  "volunteering_content":"Vice-director del comite de IT (ITcom) para el desarrollo de una plantilla para la asociacion a nivel europeo llamada: Satellite 5 (theme) - Drupal 9",
  "skills":"Cononimientos",
  "skills_technical":"Tecnicos",
  "skills_technical_1":"Drupal (8-10) - Avanzado",
  "skills_technical_2":"HTML/CSS/JavaScript - Avanzado",
  "skills_technical_3":"Vue/Svelte/TypeScript - Intermedio",
  "skills_technical_4":"PHP/Python - Intermedio",
  "skills_technical_5":"Java/Go - Principiante",
  "skills_proffessional":"Profesionales",
  "skills_proffessional_1":"Metodologías ágiles como Scrum y Kanban",
  "skills_proffessional_2":"Código de calidad",
  "skills_proffessional_3":"Manejo del trabajo en equipo",
  "skills_proffessional_4":"Relacion de calidad con el cliente",
  "skills_proffessional_5":"Gestión de proyectos",
  "languages":"Idiomas hablados",
  "languages_1":"Español - Nativo",
  "languages_2":"Inglés - Fluido",
  "languages_3":"Alemán - Básico",
  "print_resume":"Imprimir CV en formato PDF",
  "blog_1_title": "Mi Primer Proyecto con Svelte: Aprendiendo a Crear Sitios Web Eficientes",
  "blog_1_summary": "Explorar Svelte en mi primer proyecto marca el inicio de un camino hacia una tecnología diseñada para construir sitios web altamente eficientes. Mi objetivo es aprender haciendo: crear un proyecto desde cero para entender las características únicas de Svelte, como su ligereza, reactividad y velocidad.",
  "blog_1_detail": "Cuando escuché por primera vez sobre Svelte, me intrigó su promesa de simplicidad y eficiencia en la construcción de aplicaciones web. A diferencia de los frameworks tradicionales que añaden una capa de ejecución, Svelte compila los componentes en JavaScript altamente optimizado durante la etapa de construcción, lo que garantiza tiempos de carga más rápidos y un uso mínimo de recursos.\nMi objetivo para este proyecto no es solo crear un sitio web, sino sumergirme completamente en el ecosistema de Svelte. Planeo explorar su gestión reactiva del estado, su arquitectura basada en componentes y la ausencia de un DOM virtual. Al profundizar en esta tecnología, busco aprender a diseñar experiencias web modernas y de alto rendimiento.\nEste camino implicará desarrollar una idea de proyecto, tal vez un portafolio personal o una pequeña plataforma de comercio electrónico. Comenzaré por comprender los fundamentos de Svelte: configurar un proyecto, escribir mis primeros componentes y gestionar el estado de forma reactiva. A partir de ahí, exploraré conceptos avanzados como la renderización en el servidor (SSR) e integración con APIs externas.\nA través de este proceso de aprendizaje práctico, espero no solo dominar Svelte, sino también adoptar las mejores prácticas para crear sitios web rápidos, ligeros y fáciles de usar. Este proyecto es mi primer paso para dominar una de las herramientas de desarrollo web más emocionantes disponibles hoy en día.\nAprendizajes Clave que Anticipo:\nDominar la estructura de componentes y reactividad de Svelte.\nAprender a optimizar el rendimiento del sitio web mediante un diseño eficiente.\nEntender las herramientas potentes de SvelteKit para enrutamiento, SSR y despliegue.\nMantente al tanto de las actualizaciones de este viaje, ya que compartiré las lecciones aprendidas, los desafíos enfrentados y el resultado final.",
  "blog_published": "Publicado en ",
  "blog_not_found": "Blog no encontrado",
  "blog_back": "Volver a Blog",
  "read_more": "Leer mas",
  "work_experience_title_1": "Gestor de servicio IT (Service Manager)",
  "work_experience_content_1": "Gestioné las operaciones diarias del departamento de servicios de TI, asegurando que los sistemas, servidores y redes funcionaran sin problemas. Mejoré el rendimiento del sistema y reduje el tiempo de inactividad implementando estrategias efectivas de soporte de TI. Lenguajes y tecnologías involucrados: Vue, Directus, Java para SAP, Gitlab, Jira y Confluence. Microsoft Teams para la comunicación.",
  "work_experience_title_2": "Desarrollador Web en Drupal",
  "work_experience_content_2": "Desarrollé y mantuve sitios web en Drupal con temas y módulos personalizados. Integré servicios de terceros y aseguré que los sitios web fueran fáciles de usar, seguros y responsivos en todos los dispositivos. Lenguajes y tecnologías involucrados: Drupal, Vue, NodeJS, Bitbucket, Jira y Wiki personalizado. Zoom y Mattermost para la comunicación.",
  "work_experience_title_3": "Prácticas universitarias de investigación",
  "work_experience_content_3": "Lideré iniciativas de investigación en el campo del desarrollo web y la informática. Publiqué artículos de investigación y colaboré con otros investigadores y desarrolladores para impulsar innovaciones en la industria. Lenguajes y tecnologías involucrados: Flask, Django, PHP y Redmine. Correo electrónico y reuniones diarias para la comunicación.",
  "work_experience_title_4": "Domain Manager",
  "work_experience_content_4": "Como responsable del dominio de pagos instantáneos, superviso la estrategia, el desarrollo y las operaciones de soluciones de pago en tiempo real dentro de una institución financiera o una organización de tecnología financiera. Garantizo una integración perfecta de los sistemas de pagos instantáneos, el cumplimiento de la normativa y la alineación con los objetivos empresariales para ofrecer servicios de transacciones rápidos, seguros y fiables.",
  "education_title_1": "Grado en Ingeniería Informática",
  "education_content_1": "Obtuve un título de Ingeniería en Computación, enfocándome en desarrollo de software, redes de computadoras y gestión de bases de datos. Desarrollé una sólida base en lenguajes de programación y algoritmos generales.",
  "education_title_2": "Master en desarrollo de aplicaciones web",
  "education_content_2": "Completé una Maestría en Desarrollo de Aplicaciones Web. Me especialicé en tecnologías front-end y back-end, trabajando con frameworks como Angular para el desarrollo, Cypress para pruebas y backends construidos en Python y PHP, con un enfoque especial en crear aplicaciones web escalables y seguras.",
  "volunteering_title_1": "Administrador de contenidos web",
  "volunteering_content_1": "Gestioné el contenido del sitio web de una organización sin fines de lucro, asegurando que el contenido estuviera actualizado y alineado con los objetivos de la organización. Optimizé el contenido para SEO y mejoré la interacción del usuario a través de mejoras visuales y textuales.",
  "volunteering_title_2": "Vice director del comité de IT (ITcom)",
  "volunteering_content_2": "Serví como vicepresidente del comité de ITcom, organizando eventos tecnológicos, mentorizando miembros y colaborando con profesionales de la industria. Ayudé a guiar la estrategia del comité para apoyar la innovación y el desarrollo profesional en la comunidad tecnológica dentro de la organización ESN.",
  "techskills_title_1": "Drupal (8-10) - Avanzado",
  "techskills_content_1": "Competente en la creación y mantenimiento de sitios web dinámicos utilizando Drupal. Experiencia en desarrollo de módulos personalizados, personalización de temas e integración de servicios de terceros. Experiencia profesional: 4 años + 2 años como administrador de sistemas Drupal.",
  "techskills_title_2": "HTML/CSS/JavaScript - Avanzado",
  "techskills_content_2": "Dominio sólido de HTML5, CSS3 y JavaScript. Experiencia en la creación de diseños responsivos, animaciones CSS e interfaces de usuario interactivas con JavaScript. 7 años de experiencia, 5 de ellos profesionales.",
  "techskills_title_3": "Vue/Svelte/TypeScript - Intermedio",
  "techskills_content_3": "Experiencia intermedia con Vue.js, Svelte y TypeScript para la construcción de aplicaciones web. Familiarizado con la gestión de estados y el desarrollo basado en componentes. 2 años de experiencia profesional y un año adicional de experiencia académica con Angular.",
  "techskills_title_4": "PHP/Python - Intermedio",
  "techskills_content_4": "Experiencia de nivel medio en PHP y Python para desarrollo back-end. Experiencia con frameworks como Laravel para PHP y Flask para Python, así como integración de bases de datos y APIs. 4 años de experiencia profesional en PHP + 3 años de experiencia en Python combinando estudios y proyectos personales.",
  "techskills_title_5": "Java/NodeJS/Go - Principiante",
  "techskills_content_5": "Conocimientos básicos de Java, NodeJS y Go. Familiaridad con la construcción de aplicaciones básicas, uso de bibliotecas y comprensión de conceptos clave de programación. 1 año de experiencia personal tanto con Java como con Go.",
  "personalskills_title_1": "Formato scrum y Kanban",
  "personalskills_content_1": "Experiencia en prácticas de desarrollo Agile, particularmente Scrum y Kanban. Habilidad para gestionar sprints, garantizar flujos de trabajo eficientes y entregar proyectos de alta calidad a tiempo.",
  "personalskills_title_2": "Calidad de código",
  "personalskills_content_2": "Enfoque fuerte en la calidad del código, incluyendo escritura de código limpio, eficiente y mantenible. Familiaridad con procesos de revisión de código, pruebas unitarias y técnicas de depuración.",
  "personalskills_title_3": "Gestión de equipos de trabajo",
  "personalskills_content_3": "Competente en la gestión y participación en equipos multifuncionales. Habilidad para fomentar la colaboración, resolver conflictos y asegurar que los miembros del equipo trabajen de manera efectiva juntos.",
  "personalskills_title_4": "Calidad garantizada en la relación con el cliente",
  "personalskills_content_4": "Experiencia en gestión de relaciones con clientes y aseguramiento de la satisfacción a través de una comunicación clara, comprensión de sus necesidades y entrega de soluciones de alta calidad.",
  "personalskills_title_5": "Planificación de proyectos",
  "personalskills_content_5": "Organización de tareas, establecimiento de objetivos realistas y gestión del tiempo y los recursos de forma eficaz para lograr los resultados deseados. Atención al detalle, capacidad para anticiparse a los retos y coordinar los esfuerzos con eficacia.",
  "language_title_1": "Spanish - Nativo",
  "language_content_1": "Hablante nativo de español.",
  "language_title_2": "English - Fluido",
  "language_content_2": "Hablante de inglés desde la escuela primaria. Nivel actual C1.",
  "language_title_3": "German - Básico",
  "language_content_3": "Hablante de alemán desde 2021. Nivel actual A2.",
  "tech_skills": "Conocimientos técnicos",
  "personal_skills": "Conocimientos personales",
  "about_me": "Sobre mi",
  "about_passion": "Desarrollador Full-Stack apasionado y orientado a los detalles con experiencia en tecnologías front-end y back-end, incluidas JavaScript, Vue3, Python, Node.js y bases de datos como MongoDB y PostgreSQL. Experto en diseñar aplicaciones web escalables, optimizar la experiencia del usuario e implementar soluciones backend eficientes.",
  "about_experience": "Capacidad comprobada para desarrollar y mantener aplicaciones de alta calidad, colaborando con equipos multifuncionales para ofrecer experiencias digitales perfectas.",
  "about_goals": "Busco aprovechar mis habilidades técnicas y de resolución de problemas para contribuir a proyectos innovadores, mientras aprendo y evoluciono continuamente dentro de la industria tecnológica. Mi objetivo a largo plazo es liderar un equipo de desarrollo en la creación de soluciones de software impactantes.",
  "redirection_error": "Ha sido redirigido ya que la página anterior no existe.",
  "on_going": "En curso",  
  "on_hold": "En pausa",
  "in_development": "En desarrollo",
  "finished": "Finalizado",
  "tech_infographies": "Infografías tecnológicas",
  "tech_infographies_why": "Objetivos del proyecto:",
  "tech_infographies_main": "Tareas principales:",
  "tech_infographies_status": "Estado",
  "tech_infographies_start": "Fecha de inicio: ",
  "tech_infographies_end": "Fecha fin: ",
  "tech_infographies_repo": "Visitar repositorio",
  "tech_infographies_live": "Ver en vivo",
  "tech_infographies_docs": "Documentación del proyecto",
  "tech_infographies_protected_data": "Proyecto privado",
  "hema_reason": "Creación y mantenimiento de un portal e-commerce efficiente y rápido de un portal de moda atelier.",
  "catalog": "Visualización del catálogo",
  "product": "Product selection",
  "cart": "Cart management",
  "checkout": "Fast checkout",
  "whoami_reason": "Personal portfolio website.",
  "resume_visual": "Resume visualization",
  "project_exh": "Project exhibition",
  "professional_development": "Professional development and contact.",
  "financapp_reason_fe": "Personal finances application. Salary and mortgage calculator. Stock market investments tracking.",
  "data": "Data visualization",
  "user_auth": "User authentication",
  "API": "API integrations",
  "economic_calc": "Different economic calculations",
  "exodus_reason_fe": "Frontend data visualization for user living standards studies and migration puposes.",
  "living_metrics": "Living metrics calculation",
  "coosto_reason": "Company's public website used for marketing and sales purposes.",
  "user_data": "User data tracking",
  "user_management": "User management",
  "market_campaigns": "Marketing campaigns",
  "financapp_reason_be": "Backend data calculations and API management from Real time data sources and historical sources (Finhub and Yahoo finance).",
  "live_not": "Live notifications",
  "API_end": "RESTful API endpoints",
  "exodus_reason_be": "Backend data calculations for user living standards studies and migration puposes.",
  "data_collection": "Data collection (source numbeo)",
  "currency": "Currency change",
  "tech_infographies_github": "Visit my GitHub",
  "tech_infographies_projects": "Take a look to my projects",
  "poetry_ai_gen_reason": "Generador de poesía mediante IA basada en redes neuronales",
  "data_gen": "Generación de datos",
  "mach_learn": "Aprendizaje computacional",
  "neural_net": "Redes neuronales",
  "search_placeholder": "Buscar",
  "domain_manager": "Administrador de dominio de la sección de pagos instantáneos. Bizum, Pagos instantáneos masivos, Pagos instantáneos B2B, B2C y C2C, Reembolso de pagos instantáneos. Responsable de las comunicaciones entre los diferentes equipos implicados: Infraestructura, Bussines Partners, Canales digitales, Pagos con tarjeta, UX/UI, Robótica y Proveedores externos (on-shore y off-shore) Tecnologías asociadas: Redsys, Sterling IBM"
}
